using System.Reflection;
using System.Runtime.CompilerServices;
using System.Runtime.InteropServices;

// Управление общими сведениями о сборке осуществляется с помощью 
// набора атрибутов. Измените значения этих атрибутов, чтобы изменить сведения,
// связанные со сборкой.
[assembly: AssemblyTitle("Учет студентов")]
[assembly: AssemblyDescription("Учебный процесс университета невозможен без четкой координации действий огромного количества учащихся. Для этого существует четкая структуризация учебных групп. Данная информационная система систематезирует все имеющиеся индивидуальные данные каждого учащегося и позволяет легко и быстро найти информацию о любом студенте. Так же, огромным бонусом является то, что вся внесенная вами информация моментально сохраняется и вам совсем не нужно беспокоиться об постоянном сохранении. За детальной информацией обращайтесь к справке продукта")]
[assembly: AssemblyConfiguration("")]
[assembly: AssemblyCompany("Валера&Стас")]
[assembly: AssemblyProduct("Учет студентов")]
[assembly: AssemblyCopyright("LabProduction ©  2014")]
[assembly: AssemblyTrademark("")]
[assembly: AssemblyCulture("")]

// Параметр ComVisible со значением FALSE делает типы в сборке невидимыми 
// для COM-компонентов.  Если требуется обратиться к типу в этой сборке через 
// COM, задайте атрибуту ComVisible значение TRUE для этого типа.
[assembly: ComVisible(false)]

// Следующий GUID служит для идентификации библиотеки типов, если этот проект будет видимым для COM
[assembly: Guid("98c00f44-46f4-4c18-b05c-fc895aa244c7")]

// Сведения о версии сборки состоят из следующих четырех значений:
//
//      Основной номер версии
//      Дополнительный номер версии 
//   Номер сборки
//      Редакция
//
// Можно задать все значения или принять номера сборки и редакции по умолчанию 
// используя "*", как показано ниже:
// [assembly: AssemblyVersion("1.0.*")]
[assembly: AssemblyVersion("1.0.0.0")]
[assembly: AssemblyFileVersion("1.0.0.0")]
